## CSCI 303
# Introduction to Data Science
<p/>
### 13 - Working with Databases (2): SQL & Pandas

![Relational database icon](sql.png)

## This Lecture
---
- More SELECT queries
  - [SQL: Operators and function](#operators_functions)
  - [SQL: Sorting](#sorting)
      - [pandas.sort_values()](#sortingpandas)
      - [pandas.str.contains()](#str.contains)
  - [SQL: Grouping and aggregating](#groupingaggregating)
      - [pandas.value_counts()](#value_counts)
  - [SQL: Joining tables](#joining) 
     - [pd.merge](#pd.merge) 
  - [Final Data Cleaning Example](#datacleaning): finding duplications in both tables
      - [Pandas groupby/aggregation](#pd.groupby')

The obligatory setup code...

In [1]:
import pandas as pd
import numpy as np

from pandas import Series, DataFrame

dburi = 'postgresql://guest:mines2017@flowers.mines.edu/csci303'

Let's also display info about the tables we'll be using in our examples:

In [2]:
from sqlalchemy import create_engine, inspect
inspector = inspect(create_engine(dburi))
#returns list of databases
inspector.get_schema_names()
# list tables
inspector.get_table_names('public')

/usr/local/lib/python3.7/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

['scifi_author',
 'employees',
 'scifi_work',
 'occupation_codes',
 'occupation_attainments',
 'occupation_assignments',
 'employees2',
 'customers',
 'departments',
 'boston']

### Table 1 scifi_author (*a*)

In [5]:
pd.DataFrame(inspector.get_columns('scifi_author'))

   autoincrement comment default        name  nullable     type
0          False    None    None          id     False     TEXT
1          False    None    None        name     False     TEXT
2          False    None    None  birth_year      True  INTEGER
3          False    None    None  death_year      True  INTEGER

### Table 2 scifi_work (*w*)

In [6]:
pd.DataFrame(inspector.get_columns('scifi_work'), columns=['name','type'])

               name     type
0                id     TEXT
1         author_id     TEXT
2             title     TEXT
3  publication_year  INTEGER

## Operators and Functions
<a id='operators_functions'></a>
---
Wildcard matching using `LIKE`:

In [7]:
pd.read_sql_query("SELECT * FROM scifi_author WHERE name LIKE 'A%%'", dburi)

                    id              name  birth_year  death_year
0  /authors/OL3399168A        Ann Leckie         NaN         NaN
1    /authors/OL24708A    A. E. van Vogt      1912.0      2000.0
2  /authors/OL7304221A  Arthur C. Clarke         NaN         NaN
3  /authors/OL2623461A  Arthur C. Clarke      1917.0      2008.0
4  /authors/OL7228383A        Ann Leckie         NaN         NaN
5  /authors/OL7099704A      Andre Norton      1912.0      2005.0
6  /authors/OL7319169A  Arthur C. Clarke         NaN         NaN
7   /authors/OL218124A     Alfred Bester      1913.0      1987.0

The '%' wildcard matches any string of any length, so the above query asks for all authors where the author name starts with an 'A'.

Note that the wildcard in SQL is just a single '%', but that has meaning in Python strings, so we have to escape it by using an extra '%'.

You can also use '_' to stand in for any single character.

So, for instance, we could get authors for whom we have only a first initial:

In [8]:
pd.read_sql_query("SELECT * FROM scifi_author WHERE name LIKE '_. %%'", dburi)

                    id            name  birth_year  death_year
0  /authors/OL7046811A   C. J. Cherryh         NaN         NaN
1    /authors/OL24708A  A. E. van Vogt      1912.0      2000.0
2  /authors/OL7313078A   C. J. Cherryh         NaN         NaN
3  /authors/OL7342190A   C. J. Cherryh         NaN         NaN
4  /authors/OL7319469A   C. J. Cherryh         NaN         NaN

SQL has numerous functions and operators.  For instance, pretty much any mathematical expression is allowed:

In [9]:
query = """
 SELECT name, death_year - birth_year AS approx_age 
 FROM scifi_author 
 WHERE death_year IS NOT NULL
"""

pd.read_sql_query(query, dburi)

                  name  approx_age
0       A. E. van Vogt          88
1     Arthur C. Clarke          91
2     Cordwainer Smith          53
3   Robert A. Heinlein          81
4    Clifford D. Simak          84
5        Roger Zelazny          58
6         Isaac Asimov          72
7         Andre Norton          93
8        Alfred Bester          74
9       Philip K. Dick          54
10       Poul Anderson          75

We slipped in a couple of other SQL things there.  Let's explain those.

First, the `AS` keyword lets us create/rename or "alias" a column.  That's handy when doing an expression like above.

We'll see other uses for `AS` later.

Also, we used another operator, `IS NOT NULL`.

NULL values in SQL are not comparable - any attempt to compare them using a relational operator (such as =) will always return false!

Instead, use `IS NULL` and `IS NOT NULL` to accept/reject NULL values.

### Panda-ish way
<font color='red'> Similar query, but instead we create & concatenate new column `AGE`. Give it a shot!

In [3]:
authors_years =pd.read_sql_query("SELECT name, death_year, birth_year FROM scifi_author WHERE death_year IS NOT NULL", dburi)
authors_years['AGE'] = authors_years.death_year - authors_years.birth_year
authors_years.head()

                 name  death_year  birth_year  AGE
0      A. E. van Vogt        2000        1912   88
1    Arthur C. Clarke        2008        1917   91
2    Cordwainer Smith        1966        1913   53
3  Robert A. Heinlein        1988        1907   81
4   Clifford D. Simak        1988        1904   84

There are a number of useful string functions and operators.

For example, is it "A. E. Van Vogt", or "A. E. van Vogt"?

We can convert strings to all lowercase using `lower`:

In [4]:
pd.read_sql_query("SELECT * FROM scifi_author WHERE name LIKE '%%van vogt'", dburi)
#pd.read_sql_query("SELECT * FROM scifi_author WHERE lower(name) LIKE '%%van vogt'", dburi)

Empty DataFrame
Columns: [id, name, birth_year, death_year]
Index: []

All of the functions and operators mentioned above are standard SQL.

Your database may supply (many) others in addition.

For example, here's a link to documentation on PostgreSQL's functions and operators:
https://www.postgresql.org/docs/9.5/static/functions.html

## Sorting <a id='sorting'></a>
---
To sort the results of a query, add an `ORDER BY` clause.

`ORDER BY` is followed by the columns you want to sort by.  Each column name can optionally be followed with `ASC` (the default) or `DESC` to determine whether the sort is ascending or descending.

In [5]:
pd.read_sql_query("SELECT * FROM scifi_author ORDER BY name", dburi)[:10]
#pd.read_sql_query("SELECT * FROM scifi_author ORDER BY name DESC", dburi)[:10]

                    id              name  birth_year  death_year
0    /authors/OL24708A    A. E. van Vogt      1912.0      2000.0
1   /authors/OL218124A     Alfred Bester      1913.0      1987.0
2  /authors/OL7099704A      Andre Norton      1912.0      2005.0
3  /authors/OL7228383A        Ann Leckie         NaN         NaN
4  /authors/OL3399168A        Ann Leckie         NaN         NaN
5  /authors/OL7304221A  Arthur C. Clarke         NaN         NaN
6  /authors/OL7319169A  Arthur C. Clarke         NaN         NaN
7  /authors/OL2623461A  Arthur C. Clarke      1917.0      2008.0
8   /authors/OL343157A    Charles Stross      1964.0         NaN
9  /authors/OL7313078A     C. J. Cherryh         NaN         NaN

In [6]:
query = """
 SELECT name, death_year - birth_year AS approx_age 
 FROM scifi_author 
 WHERE death_year IS NOT NULL
 ORDER BY approx_age DESC
"""

pd.read_sql_query(query, dburi)

                  name  approx_age
0         Andre Norton          93
1     Arthur C. Clarke          91
2       A. E. van Vogt          88
3    Clifford D. Simak          84
4   Robert A. Heinlein          81
5        Poul Anderson          75
6        Alfred Bester          74
7         Isaac Asimov          72
8        Roger Zelazny          58
9       Philip K. Dick          54
10    Cordwainer Smith          53

### Panda-ish way <a id='sortingpandas'></a>
`df.sort_values(...)` will give you a new df (dataframe) that is sorted on the column you choose.

In [7]:
authors_years.sort_values(by=['AGE']) #,ascending=False

                  name  death_year  birth_year  AGE
2     Cordwainer Smith        1966        1913   53
9       Philip K. Dick        1982        1928   54
5        Roger Zelazny        1995        1937   58
6         Isaac Asimov        1992        1920   72
8        Alfred Bester        1987        1913   74
10       Poul Anderson        2001        1926   75
3   Robert A. Heinlein        1988        1907   81
4    Clifford D. Simak        1988        1904   84
0       A. E. van Vogt        2000        1912   88
1     Arthur C. Clarke        2008        1917   91
7         Andre Norton        2005        1912   93

## DISTINCT
---
Somewhat related to sorting, sometimes you want to get only a unique set of records back.

This is particularly useful when trying to find the unique settings for a particular column.

For instance, our data unfortunately has a lot of duplicates.

Let's see just the unique author names starting with 'C':

In [8]:
query = """
SELECT DISTINCT name
FROM scifi_author
WHERE name LIKE 'C%%'
"""

pd.read_sql_query(query, dburi)

                name
0      C. J. Cherryh
1      Connie Willis
2   Cordwainer Smith
3     Charles Stross
4  Clifford D. Simak

### Pandas way: str.contains <a id='str.contains'></a>
Example for finding string that contains `N, M, V or R`
```
df[df['Office'].str.contains("^(?:N|M|V|R)")]

or:

df[df['Office'].str.contains("^[NMVR]+")]
```
[Trouble-shooting Link](https://stackoverflow.com/questions/40249152/python-3-pandas-select-dataframe-using-startswith-or)

<font color='red'> When I tried `str.contains` & `str.startwith`, the results ddidn't seem to be as exhaustive as the SQL way. Can you match the SQL output?

In [9]:
authors_complete = pd.read_sql_query("SELECT name FRom scifi_author",dburi)
authors_complete[authors_complete['name'].str.startswith("C")].name.unique().to_frame()

AttributeError: 'numpy.ndarray' object has no attribute 'to_frame'

## Grouping and Aggregating <a id='groupingaggregating'></a>
---
SQL has capabilities for grouping data and computing aggregate functions on the groups. Pandas can also do this: [example in this notebook](#pd.groupby) and [official documentation](https://pandas.pydata.org/pandas-docs/version/0.21/generated/pandas.DataFrame.groupby.html).

The basic syntax is

```
SELECT a1, a2, ..., fn1(a3), fn2(a4), ...
FROM table
GROUP BY a1, a2, ...;
```

where `fn1` etc. compute some kind of aggregate.  Some of the functions available are `COUNT`, `SUM`, `AVG`, `MIN`, and `MAX`.

It is important that every attribute selected participate in the group operation.

For example, this query is valid and finds out the multiplicity of each author in our database:

In [ ]:
query = """
SELECT name, COUNT(name) FROM scifi_author
GROUP BY name
"""

pd.read_sql_query(query, dburi)

whereas this query is invalid, because we are not grouping by birth_year:

In [ ]:
query = """
SELECT name, COUNT(name), birth_year FROM scifi_author
GROUP BY name
"""
pd.read_sql_query(query, dburi)

Usefully, we can also `ORDER BY` aggregate expressions. Suppose we want the most duplicated authors (to see where we need to do the most cleanup):

In [ ]:
query = """
SELECT name, COUNT(name) FROM scifi_author
GROUP BY name
ORDER BY COUNT(name) DESC
"""
pd.read_sql_query(query, dburi)

### More panda aggregate counting
<a id='value_counts'></a>
.to_frame() otherwise you just get an array back without authors attached...

In [ ]:
authors =pd.read_sql_query('SELECT name FROM scifi_author',dburi)  # same error if we add birth year
authors.name.value_counts().to_frame()

### Give the column key the right name

`Rename` seems to mess with the index, so you have to rename again.
[complaint here](https://github.com/pandas-dev/pandas/issues/18828)

In [ ]:
author_counts=authors['name'].value_counts().to_frame().rename(columns={"name": "count"})
author_counts
#author_counts.reset_index()
author_counts.rename(index=str,columns={"index": "name"})

### Back to SQL
We can also use another clause with the keyword `HAVING`, which lets us filter the grouped results according to aggregate values.  Let's only see the authors with multiplicity greater than 2:

In [ ]:
query = """
SELECT name, COUNT(name) FROM scifi_author
GROUP BY name
HAVING COUNT(name) > 2
"""
pd.read_sql_query(query, dburi)

Pandas also has a `where` function, but the condition needs to have the same shape as the dataframe, so boolean indexing is usually easier.
<font color='red'> What dataframe have we been working with? How do we do the Boolean indexing? Match the output above...

Aggregate functions can also be applied without grouping:

In [ ]:
query = """
 SELECT 
   MIN(death_year - birth_year),
   AVG(death_year - birth_year),
   MAX(death_year - birth_year) 
 FROM scifi_author 
 WHERE death_year IS NOT NULL
"""

pd.read_sql_query(query, dburi)

### <font color='red'> And pandas?

## Joins
<a id='joining'></a>
---
Databases are often factored in such a way as to minimize duplicate information.  (This database didn't succeed so well in that.)

For example, we have a table of Science Fiction works, but it doesn't include author names or dates.  

Rather, the authors live in a separate table, and are simply referenced by a key field from the works table.

In [ ]:
pd.DataFrame(inspector.get_columns('scifi_work'), columns=['name','type'])

### The `author_id` field provides our linkage to the `scifi_author` table.

There are two ways to do inner joins, which are the joins we most commonly want to do.

Here's the "wordy" way to join `scifi_author` and `scifi_work`:

In [ ]:
query = """
SELECT scifi_author.name, scifi_work.title, scifi_work.publication_year
FROM   scifi_author JOIN scifi_work ON scifi_author.id = scifi_work.author_id
"""

pd.read_sql_query(query, dburi)

Some of the table name specifiers are unnecessary in the above query, as SQL can work out what table you mean if the column name is unique.

The only column we really *need* the specifier on is the `scifi_author.id` column, since there is also a column named `id` in `scifi_work`.

However, it makes things clearer if we do something to specify what tables columns are coming from.

This is a common use of table aliases using the `AS` keyword.

In [ ]:
query = """
SELECT a.name, w.title, w.publication_year
FROM   scifi_author AS a JOIN scifi_work AS w
ON a.id = w.author_id
"""

pd.read_sql_query(query, dburi)

An equivalent, and more compact way to write the same query is to move the join condition(s) into the WHERE clause, and simply list the tables you want data from:

In [ ]:
query = """
SELECT a.name, w.title, w.publication_year
FROM scifi_author AS a, scifi_work AS w
WHERE a.id = w.author_id
"""
pd.read_sql_query(query, dburi)

Now we can ask questions like, "What books did Ann Leckie write?"

In [ ]:
query = """
SELECT a.name, w.title, w.publication_year
FROM scifi_author AS a, scifi_work AS w
WHERE a.id = w.author_id
AND a.name = 'Ann Leckie'
"""
pd.read_sql_query(query, dburi)

<font color='red'> Or, "Who wrote *I, Robot*?"

In [ ]:
query = """

"""
pd.read_sql_query(query, dburi)

## Join with pandas: `merge`
<a id='pd.merge'></a>
Notebook `03.07-Merge-and-Join.ipynb` from the *Python Data Science Handbook* is really good.

In [ ]:
a = pd.read_sql_query('SELECT name, id FROM scifi_author', dburi)
w = pd.read_sql_query('SELECT title, author_id, publication_year FROM scifi_work', dburi)
display(a.head())
display(w.head())

## pd.merge() <a id='pd.merge'></a>
---
- One to many 
- Many to one
- No matching columns: ``left_on``,  ``right_on``
- join() method, which performs a merge that defaults to joining on indices

In [ ]:
a.merge(w, left_on="id", right_on="author_id")

<font color='red'> Can you get rid of the redundant column? Filter on Ann Leckie?

In [ ]:
a.merge(w, left_on="id", right_on="author_id")

## Putting It All Together <a id='datacleaning'></a>
---
Now that we know the basics, let's try some queries with the Sci-fi books dataset.

Let's start with, "How many books are listed for each author entry?"
Let's try grouping by author name:

In [ ]:
query = """
SELECT a.name, COUNT(w.title)
FROM   scifi_author AS a, scifi_work AS w
WHERE  a.id = w.author_id
GROUP BY a.name
ORDER BY a.name
"""
pd.read_sql_query(query, dburi)

In [ ]:
a_w_together = a.merge(w, left_on="id", right_on="author_id")
## Get rid of redundant axis
a_w_together = a.merge(w, left_on="id", right_on="author_id").drop('id', axis=1)
a_w_together[a_w_together.name.str.contains('Ann Leckie')] # boolean

### SQL 
I wonder if duplication is a problem in the works data, too?

Let's look closer at one of our more prolific authors (Arthur C. Clarke):

In [ ]:
query = """
SELECT w.title, COUNT(w.title)
FROM   scifi_author AS a, scifi_work AS w
WHERE  a.id = w.author_id
AND    a.name = 'Arthur C. Clarke'
GROUP BY w.title
HAVING COUNT(w.title) > 1
ORDER BY w.title
"""
pd.read_sql_query(query, dburi)

### Pandas: counting titles
<font color='red'> This is similar to what we did before.  Can you get the table above using a_w_together and pandas functionality?

### SQL
Hm, maybe we can filter this down a bit.  It turns out you can combine COUNT and DISTINCT - this will at least let us remove books with exact duplicate titles.

(It still won't help with books that are the same but are listed differently, or books in other languages.)

In [ ]:
query = """
SELECT a.name, COUNT(w.title), COUNT(DISTINCT w.title)
FROM   scifi_author AS a, scifi_work AS w
WHERE  a.id = w.author_id
GROUP BY a.name
ORDER BY a.name
"""
pd.read_sql_query(query, dburi)

### Checking for duplicates for Pandas

In [ ]:
a_w_together.head()

In [ ]:
a_w_together.groupby('name').count().title.to_frame()

#### Aggregation <a id='pd.groupby'></a>
Above is an example of  ``GroupBy`` aggregations with ``count`` but you can also use ``sum()``, ``median()``, and the like, but the ``aggregate()`` method allows for even more flexibility.
It can take a string, a function, or a list thereof, and compute all the aggregates at once.
Here is a quick example combining all these:

In [ ]:
counts = a_w_together.groupby(by='name', as_index=False).aggregate(
    {'title':pd.Series.count})
counts = counts.merge(a_w_together.groupby(by='name', as_index=False).aggregate(
    {'title':pd.Series.nunique}), on='name')
counts

If we want to see the actual distinct titles, we can just use DISTINCT without grouping:

In [ ]:
query = """
SELECT DISTINCT a.name, w.title
FROM   scifi_author AS a, scifi_work AS w
WHERE  a.id = w.author_id
ORDER BY a.name, w.title
"""
pd.read_sql_query(query, dburi)

"Which of our authors is most prolific?"

In [ ]:
query = """
SELECT a.name, COUNT(DISTINCT w.title) AS unique_count
FROM   scifi_author AS a, scifi_work AS w
WHERE  a.id = w.author_id
GROUP BY a.name
ORDER BY unique_count DESC
"""
pd.read_sql_query(query, dburi)[:5]

"What year had the most works published?"

In [ ]:
query = """
SELECT publication_year, COUNT(DISTINCT title) AS unique_count
FROM scifi_work
GROUP BY publication_year
ORDER BY unique_count DESC
"""
pd.read_sql_query(query, dburi)[:5]

"What years did Arthur C. Clarke publish the most in?"

In [ ]:
query = """
SELECT w.publication_year, COUNT(DISTINCT w.title) AS unique_count
FROM scifi_work AS w, scifi_author AS a
WHERE a.id = w.author_id AND a.name = 'Arthur C. Clarke'
GROUP BY publication_year
ORDER BY unique_count DESC
"""
pd.read_sql_query(query, dburi)[:5]